Revit 2024 API
AssetProperty.NumberOfConnectedProperties Property
 The number of currently connected properties.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int NumberOfConnectedProperties { get; }
Visual Basic
Public ReadOnly Property NumberOfConnectedProperties As Integer
	Get
Visual C++
public:
property int NumberOfConnectedProperties {
	int get ();
}
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace